---
kind: method
id: M:Autodesk.Revit.DB.Structure.StructuralSectionsServiceData.Dispose
source: html/00c06a85-1d38-586a-da53-f9df84288959.htm
---
# Autodesk.Revit.DB.Structure.StructuralSectionsServiceData.Dispose Method

Releases all resources used by the StructuralSectionsServiceData

## Syntax (C#)
```csharp
public void Dispose()
```